In [1]:
import pandas as pd

# Data Inflasi

In [9]:
df = pd.read_excel('data/Data Inflasi (2000-2025).xlsx')

In [10]:
df

       Unnamed: 0     Unnamed: 1    Unnamed: 2    Unnamed: 3
0             NaN            NaN           NaN           NaN
1    Data Inflasi   Data Inflasi  Data Inflasi  Data Inflasi
2             NaN            NaN           NaN           NaN
3              No        Periode  Data Inflasi           NaN
4               1     Maret 2025        1.03 %           NaN
..            ...            ...           ...           ...
267           264     April 2003        7.62 %           NaN
268           265     Maret 2003        7.17 %           NaN
269           266  Februari 2003         7.6 %           NaN
270           267   Januari 2003        8.68 %           NaN
271           268  Desember 2002           0 %           NaN

[272 rows x 4 columns]

In [18]:
df = df.iloc[4:].reset_index(drop=True).drop(columns=['Unnamed: 0', 'Unnamed: 3'])

In [23]:
df = df.rename(columns={'Unnamed: 1': 'Tahun', 'Unnamed: 2': 'Inflation Percentage'})

In [24]:
df

             Tahun Inflation Percentage
0       Maret 2025               1.03 %
1    Februari 2025              -0.09 %
2     Januari 2025               0.76 %
3    Desember 2024               1.57 %
4    November 2024               1.55 %
..             ...                  ...
263     April 2003               7.62 %
264     Maret 2003               7.17 %
265  Februari 2003                7.6 %
266   Januari 2003               8.68 %
267  Desember 2002                  0 %

[268 rows x 2 columns]

In [25]:
# Split the Tahun column into Bulan and Tahun
df[['Bulan', 'Tahun']] = df['Tahun'].str.split(' ', expand=True)

In [26]:
df

    Tahun Inflation Percentage     Bulan
0    2025               1.03 %     Maret
1    2025              -0.09 %  Februari
2    2025               0.76 %   Januari
3    2024               1.57 %  Desember
4    2024               1.55 %  November
..    ...                  ...       ...
263  2003               7.62 %     April
264  2003               7.17 %     Maret
265  2003                7.6 %  Februari
266  2003               8.68 %   Januari
267  2002                  0 %  Desember

[268 rows x 3 columns]

In [27]:
df.to_csv('data-cleaned/inflation_data_cleaned.csv')